In [3]:
import pandas as pd

In [4]:
data = {"name": ["a","b","c","d","a","c"],"eng": [8,7,5,8,8,5],"hindi": [2,3,4,5,2,6]}

In [7]:
df = pd.DataFrame(data)
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    5      6

The df.drop_duplicates() method returns a DataFrame with duplicates removed but does not modify the original DataFrame unless you specify inplace=True

In [9]:
df.drop_duplicates(inplace=True)
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    5      6